# --------------------------------
#           1 METHOD
# --------------------------------
from sys import setrecursionlimit
setrecursionlimit(10000) #тк в питоне есть ограничение на выполнение шагов рекурсии в 1000
                         # но память забивается, что неприятно
def f(n):
    if n < 11:
        return n
    if n >= 11:
        return n + f(n - 1)

print(f(2024) - f(2021))

# --------------------------------
#           2 METHOD
# --------------------------------
from functools import lru_cache # чтобы закэшировать информацию, программа работает быстрее

@lru_cache(None) # None, чтобы не выделялась память
def f(n):
    if n < 11:
        return n
    if n >= 11:
        return n + f(n - 1)

for i in range(10, 2025):
    f(i)

print(f(2024) - f(2021))


# --------------------------------
#           3 METHOD
# --------------------------------

f(2024) - f(2021) =
= 2024 + f(2023) + f(2022) - f(2021) =
= 2024 + 2023 + 2022 - 2021 = 609

# otvet: 6069