# _________________________________________________
#                     1 METHOD
# _________________________________________________

from itertools import product

ans = []
for r in range(4):
    for z in product('0123456789', repeat=r):
        z = ''.join(z)
        num = int(f'1234{z}7')
        if num <= 10 ** 8 and num % 141 == 0:
            ans.append([num, num // 141])
ans = sorted(ans)
for i in ans:
    print(*i)

# ___________________________________________________
#                     2 METHOD
# ___________________________________________________

from fnmatch import fnmatch

for i in range(141, 10 ** 8, 141): # но можно и просто задать начало и шаг под условие
    if fnmatch(str(i), '1234*7'):
        if i % 141 == 0: # можно исключить доп проверку, тк в range задали доп данные
            print(i, i // 141)

# otvet:
# 1234737 8757
# 12341307 87527
# 12342717 87537
# 12344127 87547
# 12345537 87557
# 12346947 87567
# 12348357 87577
# 12349767 87587